'''
Напишите программу на Python для удаления пустых кортежей из списка кортежей.
Пример данных: [(), (), ('',), ('a', 'b'), ('a', 'b', 'c'), ('d')]
Ожидаемый результат: [('',), ('a', 'b'), ('a', 'b', 'c'), 'd']
'''
a =  [(), (), ('',), ('a', 'b'), ('a', 'b', 'c'), ('d')]

for i in range(len(a)-1, 0, -1):
    if a[i] == ():
        del (a[i])
print(a)
        